Revit 2027 API
RebarSpliceByRulesResult Properties
The RebarSpliceByRulesResult type exposes the following members.
Properties
Name | Description
Error |  Identifies the error that occured during the splice by rules operation. In case of success the value of this property will be Success.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
Top
See Also
Reference
RebarSpliceByRulesResult Class
Autodesk.Revit.DB.Structure Namespace